Revit 2027 API
ExportLineweightTable.GetValues Method
 Returns all the values stored in the map.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ExportLineweightInfo> GetValues()
Public Function GetValues As IList(Of ExportLineweightInfo)
public:
IList<ExportLineweightInfo^>^ GetValues()
member GetValues : unit -> IList<ExportLineweightInfo>
Return Value
IList<ExportLineweightInfo>
 The info.
See Also
Reference
ExportLineweightTable Class
Autodesk.Revit.DB Namespace